# Tools
brew "actionlint"
brew "bottom"  # like top - but modern
#brew "bash"
brew "cmake"
brew "curl"
brew "direnv"
brew "fzf"
brew "gnu-sed"
brew "graphviz"
brew "jq"
tap "kcl-lang/tap"
brew "kcl"
brew "make"
brew "powerlevel10k"
brew "ripgrep"
brew "tree"
brew "xh" # like httpie
# Java
brew "openjdk@17"
# Golang
brew "go"
brew "go@1.21"
brew "golangci-lint"
# Python
brew "black"
brew "python"
brew "uv"  # fast pip-tools replacement
brew "mypy"
# Rust
#brew "cargo-watch"
#brew "rustup"
# Java
brew "openjdk@17"
# JS
brew "yarn"
brew "deno"
brew "fnm"  # like nvm but faster
brew "node"
brew "nvm"
brew "pnpm"
# Docker
brew "dive"
# Kubernetes
brew "cdk8s"
brew "cdktf"
brew "ctlptl"
brew "helm"
#brew "derailed/k9s/k9s"
brew "k9s"
brew "kind"
brew "cloudflared"
brew "kubernetes-cli"
brew "tilt"
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
# Github helper
brew "git"
brew "act"  # run github actions locally
brew "actionlint"
brew "commitizen"
brew "gh"
brew "hub"
# AWS
brew "awscli"
brew "aws-cdk"
# DB
brew "mongosh"
brew "postgresql@16"
brew "postgresql@17", restart_service: true

# Casks
cask "flameshot"
 # xattr -l /Applications/flameshot.app
 # xattr -d com.apple.quarantine /Applications/flameshot.app
 # xattr -l /Applications/flameshot.app
cask "iterm2"
cask "raycast"
cask "warp"
cask "tableplus"

# Visual Studio Code Extensions
# 'vscode --install-extension'
vscode "ms-python.vscode-pylance"
vscode "ms-python.python"
vscode "ms-python.debugpy"
vscode "matangover.mypy"
vscode "charliermarsh.ruff"
vscode "dsznajder.es7-react-js-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "golang.go"
vscode "kcl.kcl-vscode-extension"
vscode "mathiasfrohlich.kotlin"
vscode "yzhang.markdown-all-in-one"
vscode "jebbs.plantuml"
vscode "mebrahtom.plantumlpreviewer"
vscode "esbenp.prettier-vscode"
vscode "asciidoctor.asciidoctor-vscode"
vscode "arahata.linter-actionlint"
vscode "rust-lang.rust-analyzer"
