tap "buo/cask-upgrade"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kcl-lang/tap"
tap "mongodb/brew"
tap "stackitcloud/tap"
brew "act"
brew "actionlint"
brew "ca-certificates"
brew "node"
brew "aws-cdk"
brew "python@3.13"
brew "awscli"
brew "bitwarden-cli"
brew "black"
brew "bottom"
brew "cargo-watch"
brew "cdk8s"
brew "cdktf"
brew "cloudflared"
brew "cmake"
brew "commitizen"
brew "ctlptl"
brew "curl"
brew "deno"
brew "direnv"
brew "dive"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "go"
brew "go@1.21"
brew "golangci-lint"
brew "harfbuzz"
brew "graphviz"
brew "helm"
brew "hub"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "make"
brew "mas"
brew "mongosh"
brew "mypy"
brew "nvm"
brew "openjdk@17"
brew "pnpm"
brew "postgresql@12"
brew "postgresql@14"
brew "postgresql@16"
brew "postgresql@17", restart_service: :changed
brew "powerlevel10k"
brew "python@3.12"
brew "ripgrep"
brew "tilt"
brew "tree"
brew "uv"
brew "xh"
brew "yarn"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "kcl-lang/tap/kcl"
brew "mongodb/brew/mongodb-database-tools"
cask "flameshot"
cask "iterm2"
cask "raycast"
cask "tableplus"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "1yib.rust-bundle"
vscode "arahata.linter-actionlint"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "ciarant.vscode-structurizr"
vscode "danielroedl.meld-diff"
vscode "dbaeumer.vscode-eslint"
vscode "didericis.starlark"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "fnando.linter"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "jebbs.plantuml"
vscode "kcl.kcl-vscode-extension"
vscode "matangover.mypy"
vscode "mathiasfrohlich.kotlin"
vscode "mebrahtom.plantumlpreviewer"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "panicbit.cargo"
vscode "rust-lang.rust-analyzer"
vscode "simonsiefke.svg-preview"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vadimcn.vscode-lldb"
vscode "yzhang.markdown-all-in-one"
cask "slack"
cask "stackit"
brew "dust"
