# Tools
brew "bottom"  # like top - but modern
#brew "bash"
brew "cmake"
brew "curl"
brew "direnv"
brew "jq"
brew "make"
brew "powerlevel10k"
brew "ripgrep"
brew "tree"
brew "xh" # like httpie
# Golang
brew "go"
brew "go@1.21"
brew "golangci-lint"
# Python
brew "black"
brew "python"
brew "uv"  # fast pip-tools replacement
# Rust
brew "cargo-watch"
brew "rustup"
# JS
brew "deno"
brew "fnm"  # like nvm but faster
brew "node"
#brew "nvm"
brew "pnpm"
# Docker
brew "dive"
# Kubernetes
brew "cdk8s"
brew "cdktf"
brew "ctlptl"
brew "helm"
#brew "derailed/k9s/k9s"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "tilt"
# Github helper
brew "act"  # run github actions locally
brew "actionlint"
brew "commitizen"
brew "gh"
brew "hub"
# AWS
brew "awscli"
brew "aws-cdk"
# DB
brew "mongosh"

# Casks
cask "iterm2"
cask "raycast"

# Visual Studio Code Extensions
# 'vscode --install-extension'
vscode "dsznajder.es7-react-js-snippets"
vscode "golang.go"
vscode "ms-python.vscode-pylance"
vscode "ms-python.python"
vscode "ms-python.debugpy"



